Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
aws_secretsmanager_secret.terraform_test: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:301838289846:secret:terraform_test-889xI8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_secretsmanager_secret.terraform_test1 will be created
+ resource "aws_secretsmanager_secret" "terraform_test1" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "terraform_test1"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ec2-13-233-192-55.ap-south-1.compute.amazonaws.com:4141/lock?id=AthivaTechnology%252Fatalntis-terraform%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
